internal/pgbenchresult/testdata/unknown-field.txt
pgbench (19devel, server 19devel)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 1000
number of failed transactions: 0 (0.000%)
experimental magic score: 42
latency average = 1.000 ms
tps = 1000.000000 (without initial connection time)